Tekla.Structures.Model.Position
The Position class defines how a part is positioned relative to the input.
Defining the position of a bolt array instance:
using Tekla.Structures.Model;
public class Example
{
public void Example1()
{
BoltArray MyBoltArray = new BoltArray();
MyBoltArray.Position.Depth = Position.DepthEnum.MIDDLE;
MyBoltArray.Position.DepthOffset = 3;
MyBoltArray.Position.Plane = Position.PlaneEnum.MIDDLE;
MyBoltArray.Position.PlaneOffset = 1;
MyBoltArray.Position.Rotation = Position.RotationEnum.FRONT;
MyBoltArray.Position.RotationOffset = 2;
}
}

Tekla.Structures.Model.Position.PlaneOffset
The offset away from the Plane value.

Tekla.Structures.Model.Position.DepthOffset
The offset away from the Depth value.

Tekla.Structures.Model.Position.RotationOffset
The offset away from the Rotation value.

Tekla.Structures.Model.Position.Plane
Indicates the positioning in the plane sense.

Tekla.Structures.Model.Position.Depth
Indicates the positioning in the depth sense.

Tekla.Structures.Model.Position.Rotation
Indicates the positioning in the rotational sense.

Tekla.Structures.Model.Position.#ctor
Creates a new position instance.